# Создание и запуск проекта в pyCharm:
# - необходимо создать новый проект.
# - выбрать интерпритатор пайтон
# - создать модуль в котором будем писать код.
# - запуск программы с пайчарм.
#
# Запустим пайчарм первый раз. предлагает сначала импортировать настройки. Соглашаемся с лицензионным использованием. Будем отправлять статистику. Далее предлагается выбрать тему тёмную или светлую. Плагины оставим пок абез изменения. Криейт нью проджект.
# давайте напишем имя проекта. и нажимаем создать! можно изменить папку по умолчанию, путь куда сохранить файл.
# далее при запуске пайчарм будет настраивать окружение.после того как он это сделает мы сможем писать код. последующие разы когда мы будем запускать пайчарм он уже не будет это делать. все будет происходить гораздо быстрее
# перехожу далее в пайчарм и буду писать уже там. этот текст копирую туда же.
#
#Что мы видим, открыв пайчарм? :
#слева (лп) у нас есть структура проекта. Пайчарм создал для нас виртуальное окружение (venv library root) в котором мы можем работать.
#давайте создадим теперь в папке educationCourseAll.py  питон файл. пкм в лп по названию папки во всплывающем меню - new  -->  python file
#файлы у нас зоздаются с расширением py? именно эти файлы понимает интерпритатор, который мы установили.
#давайте напишем нашу первую программу хеллоу ворлд: файл - новый - pr1helloworld.py
########################