# Криптокошельки
Криптокошелёк — инструмент, который позволяет работать с блокчейном. По сути, это аналог банковского счёта. Для обмена деньгами в банковской системе мы используем номер карты, а в блокчейне — публичный ключ криптокошелька, или, иначе, его адрес. На заданный адрес криптокошелька другие пользователи могут отправлять криптовалюту или NFT, о которых мы расскажем позже.

В банковской системе для перевода денег нам нужна дополнительная информация в виде CVV/CVC и кода подтверждения из SMS. В блокчейне эту роль играет приватный ключ. Он подтверждает проводимую транзакцию. При создании криптокошелька пользователь получает секретную фразу, она же seed-фраза, благодаря которой у него появляется доступ к ключам.

# Типы кошельков
В целом криптокошельки можно разделить на «горячие» и «холодные». С первыми возможно работать только при наличии интернета, в то время как вторые представляют собой физические носители для хранения ключей от вашего цифрового бумажника.

# Как мне создать криптокошелёк?
Тут всё очень просто! Для примера возьмём наиболее известный сервис — MetaMask, остальные кошельки заводятся по аналогии.

# Шаг 1
Сначала установите расширение для браузера или мобильное приложение криптокошелька MetaMask c официального сайта:

> https://metamask.io/download

При создании цифрового бумажника внимательно прочитайте все инструкции на экране, а мы вам поможем.

# Шаг 2
Откройте приложение. Вам будет предложено создать или импортировать счёт. Нажмите «Создать кошелёк».

# Шаг 3
Далее придумайте надёжный пароль, запомните его и перейдите к следующему шагу.

# Шаг 4
Если хотите узнать больше про секретную фразу, сделайте это сейчас, вся информация есть в этом шаге.

# Шаг 5
Далее вы получите фразу из 12 слов, которые нужно записать и сохранить в надёжном месте. Главное, что следует помнить, — никому не сообщайте эту фразу! Она даёт полный доступ к вашему кошельку.

# Шаг 6
Теперь нужно подтвердить фразу, выбрав слова в нужной последовательности.

# Готово!
Отныне вы обладатель собственного криптокошелька.

### 1. Что такое приватный ключ?

- Пароль от криптокошелька -

- Набор из 12 слов, дающий доступ к управлению кошельком -

- Набор символов, доступный только владельцу кошелька и подтверждающий транзакции в блокчейне
Верно +ВЕРНО+

### 2. Чем «горячий» криптокошелёк отличается от «холодного»?

- «Холодный» кошелёк даёт доступ к большему количеству криптовалют

- «Горячий» кошелёк требует подключения к интернету, в отличие от «холодного» +ВЕРНО+

- «Горячий» кошелёк надёжнее

# Так держать!
Урок завершён: вы стали ещё на один шаг ближе к уникальному эмодзи-статусу «Знаток NFT». Продолжайте погружаться в мир токенов — переходите к следующему блоку «Криптошколы».
